{
  "architectures": [
    "PaliGemmaForConditionalGeneration"
  ],
  "bos_token_id": 2,
  "dtype": "bfloat16",
  "eos_token_id": 1,
  "hidden_size": 2048,
  "ignore_index": -100,
  "image_token_index": 257152,
  "model_type": "paligemma",
  "pad_token_id": 0,
  "projection_dim": 2048,
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 2,
    "dtype": "bfloat16",
    "eos_token_id": 1,
    "head_dim": 256,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 2048,
    "initializer_range": 0.02,
    "intermediate_size": 16384,
    "max_position_embeddings": 8192,
    "model_type": "gemma",
    "num_attention_heads": 8,
    "num_hidden_layers": 18,
    "num_image_tokens": 1024,
    "num_key_value_heads": 1,
    "pad_token_id": 0,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "rope_theta": 10000.0,
      "rope_type": "default"
    },
    "tie_word_embeddings": true,
    "use_bidirectional_attention": true,
    "use_cache": true,
    "vocab_size": 257216
  },
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "use_cache": false,
  "vision_config": {
    "attention_dropout": 0.0,
    "dtype": "bfloat16",
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "image_size": 448,
    "intermediate_size": 4304,
    "layer_norm_eps": 1e-06,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 27,
    "num_image_tokens": 1024,
    "patch_size": 14,
    "projection_dim": 2048,
    "projector_hidden_act": "gelu_fast",
    "vision_use_head": false
  }
}
